tutorials-pM4F/darcyFoam/flowOnly/heterogeneousPermeability/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidProperties
{
	densityModel constantDensity;

	constantDensityCoeffs
	{
		rho0         rho0   [ 1 -3 0 0 0 0 0 ] 1000;
	}

	viscosityModel constantViscosity;

	constantViscosityCoeffs
	{
		nu0         nu0   [ 0 2 -1 0 0 0 0 ] 1e-6;
	}



}


transportModel  Newtonian;
mu             mu  [ 1 -1 -1 0 0 0 0 ] 1e-3;
//nu 		nu [ 0 2 -1 0 0 0 0 ] 1e-6;


geochemicalModel flowOnly;

geochemicalProperties
{
	 mineral (Calcite);

	 absolutePermeabilityModel heterogeneousScalarConstant;
	 heterogeneousScalarConstantCoeffs
	 {
		K0 K0 [0 2 0 0 0 0 0] 1e-11;
	//	updateFromInitialValue on;
	 }

	 dispersionModel none;

	 CalciteProperties
	 {
		activatePhaseEquilibrium false;
		rhos rhos [1 -3 0 0 0 0 0] 2707;
		Vm Vm [0 3 0 0 -1 0 0] 36.93336e-6;
		surfaceAreaModel none;
	 }

}

// ************************************************************************* //
