tutorials-pM4F/darcyFoam/flowOnly/heterogeneousPermeability/system/graphCell
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start and
    end points. One graph point is generated in each cell that the line
    intersects.

\*---------------------------------------------------------------------------*/

start   (0 0.05 0.05);
end     (2 0.05 0.05);
fields  (p U K);


axis            x; //distance; // The independent variable of the graph. Can be "x",
                          // "y", "z", "xyz" (all coordinates written out), or
                          // "distance" (from the start point).

#includeEtc "caseDicts/postProcessing/graphs/graphCell.cfg"

// ************************************************************************* //
